RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/hc32_ll_driver/inc/hc32_ll_mcan.h
/**
 *******************************************************************************
 * @file  hc32_ll_mcan.h
 * @brief This file contains all the functions prototypes of the MCAN driver
 *        library.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2023-05-31       CDT             First version
   2023-12-15       CDT             Removed definitions related to BEC and BEU.
                                    Optimized driver:
                                    1. Integrated stc_mcan_classic_config_t and stc_mcan_fd_config_t into stc_mcan_bit_time_config_t
                                    2. Integrated u32FdIso into u32FrameFormat.
                                    3. Removed API MCAN_SetFdIsoOperation(), added API MCAN_SetFrameFormat().
                                    4. Optimized the handling of the parameter stc_mcan_filter_t.u32FilterIndex
                                    5. Add 5 APIs for better get protocol status(register PSR):
                                       MCAN_GetTdcValue(), MCAN_GetDataLastErrorCode(), MCAN_GetLastErrorCode(),
                                       MCAN_GetComState(), MCAN_GetProtocolFlagStatus()
                                    6. Changed u8Activity of stc_mcan_protocol_status_t to u8ComState.
                                    7. Changed MCAN_Comm_State to MCAN_Com_State and optimized the macros definitions.
                                    8. Changed u8MsgStorageIndex of stc_mcan_hpm_status_t to u8MsgIndex. Optimized MCAN_HPM_Storage macros definitions.
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2023, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#ifndef __HC32_LL_MCAN_H__
#define __HC32_LL_MCAN_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_def.h"

#include "hc32f4xx.h"
#include "hc32f4xx_conf.h"
/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @addtogroup LL_MCAN
 * @{
 */
#if (LL_MCAN_ENABLE == DDL_ON)

/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup MCAN_Global_Types MCAN Global Types
 * @{
 */
/**
 * @brief MCAN bit time configuration structure definition
 */
typedef struct {
    /* Nominal bit time configuration, used for classic CAN frame or arbitration phase of CAN FD frame */
    uint32_t u32NominalPrescaler;           /*!< Specifies the nominal bit rate prescaler.
                                                 This parameter must be a number between 1 and 512 */
    uint32_t u32NominalTimeSeg1;            /*!< Specifies the nominal time segment before sample point(the sum of Sync_Seg,
                                                 Prop_Seg and Phase_Seg1).
                                                 This parameter must be a number between 3 and 257 */
    uint32_t u32NominalTimeSeg2;            /*!< Specifies the nominal time segment after sample point(Phase_Seg2).
                                                 This parameter must be a number between 2 and 128 */
    uint32_t u32NominalSyncJumpWidth;       /*!< Specifies the nominal (re)synchronization jump width(SJW).
                                                 This parameter must be a number between 1 and 128 */

    /* FD bit time configuration, used for data phase of CAN FD frame */
    uint32_t u32DataPrescaler;              /*!< Specifies the data bit rate prescaler.
                                                 This parameter must be a number between 1 and 32
                                                 NOTE: when u32TDC is MCAN_FD_TDC_ENABLE, the range is limited to 1, 2 */
    uint32_t u32DataTimeSeg1;               /*!< Specifies the data time segment before sample point(the sum of Sync_Seg,
                                                 Prop_Seg and Phase_Seg1).
                                                 This parameter must be a number between 2 and 33 */
    uint32_t u32DataTimeSeg2;               /*!< Specifies the data time segment after sample point(Phase_Seg2).
                                                 This parameter must be a number between 1 and 16 */
    uint32_t u32DataSyncJumpWidth;          /*!< Specifies the data (re)synchronization jump width(SJW).
                                                 This parameter must be a number between 1 and 16 */

    /* FD TDC(Transmitter Delay Compensation) configuration */
    uint32_t u32TDC;                        /*!< Enable or disable TDC(Transmitter Delay Compensation).
                                                 This parameter can be a value of @ref MCAN_TDC_Enable */
    uint32_t u32SspOffset;                  /*!< Specifies the transmitter delay compensation SSP offset.
                                                 This parameter must be a number between 0 and 127(MCAN clock) */
    uint32_t u32TdcFilter;                  /*!< Specifies the transmitter delay compensation filter window length.
                                                 This parameter defines the minimum value for the SSP position.
                                                 The feature is enabled when this parameter is configured to a value
                                                 greater than u32SspOffset.
                                                 This parameter must be a number between 0 and 127(MCAN clock) */
} stc_mcan_bit_time_config_t;

/**
 * @brief MCAN message RAM address blocks
 */
typedef struct {
    uint32_t u32StdFilterStartAddr;         /*!< Output parameter. Indicates the standard filter list start address. */
    uint32_t u32ExtFilterStartAddr;         /*!< Output parameter. Indicates the extended filter list start address. */
    uint32_t u32RxFifo0StartAddr;           /*!< Output parameter. Indicates the Rx FIFO 0 start address. */
    uint32_t u32RxFifo1StartAddr;           /*!< Output parameter. Indicates the Rx FIFO 1 start address. */
    uint32_t u32RxBufferStartAddr;          /*!< Output parameter. Indicates the Rx buffer start address. */
    uint32_t u32TxEventStartAddr;           /*!< Output parameter. Indicates the Tx event FIFO start address. */
    uint32_t u32TxBufferStartAddr;          /*!< Output parameter. Indicates the Tx buffers start address. */
    uint32_t u32TxFifoQueueStartAddr;       /*!< Output parameter. Indicates the Tx FIFO/Queue start address. */
    uint32_t u32EndAddr;                    /*!< Output parameter. Indicates the end address of the allocated RAM. */
    uint32_t *pu32StdFilterAddrList;        /*!< Pointer to an address that used to store each standard ID filter element address.
                                                 Set it to NULL if you do not need the element address information. */
    uint32_t *pu32ExtFilterAddrList;        /*!< Pointer to an address that used to store each extended ID filter element address.
                                                 Set it to NULL if you do not need the element address information. */
    uint32_t *pu32RxFifo0AddrList;          /*!< Pointer to an address that used to store each Rx FIFO0 element address.
                                                 Set it to NULL if you do not need the element address information. */
    uint32_t *pu32RxFifo1AddrList;          /*!< Pointer to an address that used to store each Rx FIFO1 element address.
                                                 Set it to NULL if you do not need the element address information. */
    uint32_t *pu32RxBufferAddrList;         /*!< Pointer to an address that used to store each Rx buffer element address.
                                                 Set it to NULL if you do not need the element address information. */
    uint32_t *pu32TxEventAddrList;          /*!< Pointer to an address that used to store each Tx event FIFO element address.
                                                 Set it to NULL if you do not need the element address information. */
    uint32_t *pu32TxBufferAddrList;         /*!< Pointer to an address that used to store each dedicated Tx buffer element address.
                                                 Set it to NULL if you do not need the element address information. */
    uint32_t *pu32TxFifoQueueAddrList;      /*!< Pointer to an address that used to store each Tx FIFO/queue element address.
                                                 Set it to NULL if you do not need the element address information. */
} stc_mcan_msg_ram_addr_t;

/**
 * @brief MCAN message RAM configuration structure definition
 */
typedef struct {
    uint32_t u32AddrOffset;                 /*!< Specifies the message RAM start address.
                                                 NOTE: The message RAM is 2K bytes and shared by MCAN1 and MCAN2. */
    uint32_t u32StdFilterNum;               /*!< Specifies the number of standard message ID filters.
                                                 This parameter is used to allocate RAM to standard ID filters.
                                                 This parameter must be a number between 0 and 128 */
    uint32_t u32ExtFilterNum;               /*!< Specifies the number of extended message ID filters.
                                                 This parameter is used to allocate RAM to extended ID filters.
                                                 This parameter must be a number between 0 and 64 */
    uint32_t u32RxFifo0Num;                 /*!< Specifies the number of Rx FIFO0 elements.
                                                 u32RxFifo0Num and u32RxFifo0DataSize are used to allocate RAM to Rx FIFO0.
                                                 This parameter must be a number between 0 and 64 */
    uint32_t u32RxFifo0DataSize;            /*!< Specifies the data field size in an Rx FIFO 0 element.
                                                 This parameter can be a value of @ref MCAN_Data_Field_Size  */
    uint32_t u32RxFifo1Num;                 /*!< Specifies the number of Rx FIFO 1 elements.
                                                 u32RxFifo1Num and u32RxFifo1DataSize are used to allocate RAM to Rx FIFO1.
                                                 This parameter must be a number between 0 and 64 */
    uint32_t u32RxFifo1DataSize;            /*!< Specifies the data field size in an Rx FIFO 1 element.
                                                 This parameter can be a value of @ref MCAN_Data_Field_Size  */
    uint32_t u32RxBufferNum;                /*!< Specifies the number of dedicated Rx buffer elements.
                                                 u32RxBufferNum and u32RxBufferDataSize are used to allocate RAM to Rx buffer.
                                                 This parameter must be a number between 0 and 64 */
    uint32_t u32RxBufferDataSize;           /*!< Specifies the data field size in an Rx buffer element.
                                                 This parameter can be a value of @ref MCAN_Data_Field_Size  */
    uint32_t u32TxEventNum;                 /*!< Specifies the number of Tx event FIFO elements.
                                                 This parameter is used to allocate RAM to Tx event FIFO.
                                                 This parameter must be a number between 0 and 32 */
    uint32_t u32TxBufferNum;                /*!< Specifies the number of dedicated Tx buffers.
                                                 u32TxBufferNum and u32TxFifoQueueNum and u32TxDataSize are used to allocate RAM for Tx messages.
                                                 The sum of u32TxBufferNum and u32TxFifoQueueNum must be a number between 0 and 32 */
    uint32_t u32TxFifoQueueNum;             /*!< Specifies the number of Tx buffers used for Tx FIFO/queue.
                                                 The sum of u32TxFifoQueueNum and u32TxBufferNum must be a number between 0 and 32 */
    uint32_t u32TxFifoQueueMode;            /*!< Specifies Tx FIFO/Queue operation mode.
                                                 This parameter can be a value of @ref MCAN_Tx_FIFO_Queue_Mode */
    uint32_t u32TxDataSize;                 /*!< Specifies the data field size in a Tx element.
                                                 This parameter can be a value of @ref MCAN_Data_Field_Size */
    uint32_t u32AllocatedSize;              /*!< Output parameter. Indicates the message RAM size that allocated to the configured MCAN.
                                                 It is also the address offset of the MCAN to be configured. */
} stc_mcan_msg_ram_config_t;

/**
 * @brief MCAN filter structure definition
 */
typedef struct {
    uint32_t u32IdType;                     /*!< Specifies the ID type.
                                                 This parameter can be a value of @ref MCAN_ID_Type */
    uint32_t u32FilterIndex;                /*!< Specifies the filter which will be initialized.
                                                 This parameter must be a number between:
                                                 - 0 and stc_mcan_msg_ram_config_t.u32StdFilterNum-1(@ref stc_mcan_msg_ram_config_t), if u32IdType is MCAN_STD_ID.
                                                 - 0 and stc_mcan_msg_ram_config_t.u32ExtFilterNum-1(@ref stc_mcan_msg_ram_config_t), if u32IdType is MCAN_EXT_ID.
                                                 NOTE: When configuring filter elements sequence by calling API MCAN_Init(), this parameter can be ignored. The local function
                                                       will handle this parameter.
                                                       When configuring filter element one by one by calling API MCAN_FilterConfig(), it is required to specify
                                                       the index of the target filter through this parameter. */
    uint32_t u32FilterType;                 /*!< Specifies the filter type.
                                                 This parameter can be a value of @ref MCAN_Filter_Type
                                                 The value MCAN_FILTER_RANGE_NO_EIDM is permitted only when u32IdType is MCAN_EXT_ID.
                                                 This parameter is ignored if u32FilterConfig is set to MCAN_FILTER_TO_RX_BUF */
    uint32_t u32FilterConfig;               /*!< Specifies the filter configuration.
                                                 This parameter can be a value of @ref MCAN_Filter_Config */
    uint32_t u32FilterId1;                  /*!< Specifies the filter ID1.
                                                 This parameter must be a number between:
                                                 - 0 and 0x7FF, if u32IdType is MCAN_STD_ID
                                                 - 0 and 0x1FFFFFFF, if u32IdType is MCAN_EXT_ID */
    uint32_t u32FilterId2;                  /*!< Specifies the filter ID2.
                                                 This parameter is ignored if u32FilterConfig is set to MCAN_FILTER_TO_RX_BUF.
                                                 This parameter must be a number between:
                                                 - 0 and 0x7FF, if u32IdType is MCAN_STD_ID
                                                 - 0 and 0x1FFFFFFF, if u32IdType is MCAN_EXT_ID */
    uint32_t u32RxBufferIndex;              /*!< Specifies the dedicated Rx buffer in which the matching message will be stored.
                                                 This parameter must be a number between 0 and 63, and less than or equal to
                                                 u32RxBufferNum of @ref stc_mcan_msg_ram_config_t
                                                 This parameter is ignored if u32FilterConfig is different from MCAN_FILTER_TO_RX_BUF */
} stc_mcan_filter_t;

/**
 * @brief MCAN filter initialization structure definition
 */
typedef struct {
    stc_mcan_filter_t *pstcStdFilterList;   /*!< Pointer to the standard ID filter elements list.
                                                 These filter elements can be configured only when:
                                                 pstcStdFilterList != NULL and
                                                 u32StdFilterConfigNum > 0 and
                                                 u32StdFilterConfigNum <= u32StdFilterNum of @ref stc_mcan_msg_ram_config_t */
    stc_mcan_filter_t *pstcExtFilterList;   /*!< Pointer to the extended ID filter elements list.
                                                 These filter elements can be configured only when:
                                                 pstcExtFilterList != NULL and
                                                 u32ExtFilterConfigNum > 0 and
                                                 u32ExtFilterConfigNum <= u32ExtFilterNum of @ref stc_mcan_msg_ram_config_t */
    uint32_t u32StdFilterConfigNum;         /*!< Number of the standard ID filter elements which to be configured.
                                                 This parameter must less than or equal to u32StdFilterNum
                                                 of @ref stc_mcan_msg_ram_config_t */
    uint32_t u32ExtFilterConfigNum;         /*!< Number of the extended ID filter elements which to be configured.
                                                 This parameter must less than or equal to u32ExtFilterNum
                                                 of @ref stc_mcan_msg_ram_config_t */
} stc_mcan_filter_config_t;

/**
 * @brief MCAN initialization structure
 */
typedef struct {
    uint32_t u32Mode;                           /*!< Specifies MCAN operating mode.
                                                     This parameter can be a value of @ref MCAN_Operating_Mode */
    uint32_t u32FrameFormat;                    /*!< Specifies the frame format supported by MCAN hardware.
                                                     This parameter can be a value of @ref MCAN_Frame_Format */
    uint32_t u32AutoRetx;                       /*!< Enable or disable automatic retransmission.
                                                     This parameter can be a value of @ref MCAN_Auto_Retx_Enable */
    uint32_t u32TxPause;                        /*!< Enable or disable transmit pause.
                                                     If transmit pause is enabled, MCAN pauses for two CAN bit times before starting
                                                     the next transmission after itself has successfully transmitted a frame.
                                                     This parameter can be a value of @ref MCAN_Tx_Pause_Enable */
    uint32_t u32ProtocolException;              /*!< Enable or disable protocol exception handling.
                                                     When this function is disabled, MCAN will transmit an error frame
                                                     when it detects a protocol exception condition.
                                                     This parameter can be a value of @ref MCAN_Protocol_Exception_Enable */
    stc_mcan_bit_time_config_t stcBitTime;      /*!< MCAN bit time configuration structure */
    stc_mcan_msg_ram_config_t stcMsgRam;        /*!< Message RAM configuration structure. */
    stc_mcan_filter_config_t stcFilter;         /*!< Acceptance filter configuration structure. */
} stc_mcan_init_t;

