RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/hc32_ll_driver/inc/hc32_ll_mcan.h
/**
 * @brief MCAN Tx message structure definition
 */
typedef struct {
    uint32_t ID;                            /*!< Specifies the ID.
                                                 This parameter must be a number between:
                                                 - 0 and 0x7FF, if IDE is 0
                                                 - 0 and 0x1FFFFFFF, if IDE is 1 */
    uint32_t IDE;                           /*!< IDentifier Extension bit. Specifies the ID type for the transmitted message.
                                                 This parameter can be a value of:
                                                 - 0: 11-bit standard ID
                                                 - 1: 29-bit extended ID */
    uint32_t RTR;                           /*!< Remote Transmission Request. Specifies the frame type of the transmitted message.
                                                 This parameter can be a value of:
                                                 - 0: Data frame to be transmitted
                                                 - 1: Remote frame to be transmitted */
    uint32_t DLC;                           /*!< Data Length Code. Specifies the length of the data field of the transmitted frame.
                                                 This parameter can be a value of @ref MCAN_Data_Length_Code */
    uint32_t ESI;                           /*!< Error State Indicator. Specifies the error state indicator.
                                                 This parameter can be a value of:
                                                 - 0: Transmitting node is error active
                                                 - 1: Transmitting node is error passive */
    uint32_t BRS;                           /*!< Bit Rate Switch. Specifies whether the Tx frame is transmitted with or without bit rate switching.
                                                 This parameter can be a value of:
                                                 - 0: Frame transmitted without bit rate switching
                                                 - 1: Frame transmitted with bit rate switching */
    uint32_t FDF;                           /*!< FD Format indicator. Specifies whether the Tx frame is transmitted in classic or FD format.
                                                 This parameter can be a value of:
                                                 - 0: Classical CAN frame format
                                                 - 1: CAN FD frame format (new DLC-coding and CRC) */
    uint32_t u32StoreTxEvent;               /*!< Specifies the event FIFO control.
                                                 This parameter can be a value of:
                                                 - 0: DO NOT store tx event
                                                 - 1: Store tx event into TX event FIFO */
    uint32_t u32MsgMarker;                  /*!< Specifies the message marker to be copied into Tx event FIFO
                                                 element for identification of Tx message status.
                                                 This parameter must be a number between:
                                                 - 0 and 0xFF if 8-bit message marker used(CCCR.WMM == 0)
                                                 - 0 and 0xFFFF if 16-bit-width message marker used(CCCR.WMM == 1) */
    uint32_t u32TxBuffer;                   /*!< Specifies the dedicated Tx buffer that used to transmit the message.
                                                 This parameter can be a value of @ref MCAN_Tx_Location
                                                 This parameter valid when Tx via dedicated Tx buffer. */
    uint8_t au8Data[64U];                   /*!< Data payload of the message that to be transmitted. */
    uint32_t u32LastTxFifoQueueRequest;     /*!< Ouput parameter of Tx buffer index of last Tx FIFO/queue request.
                                                 This parameter valid when Tx via FIFO or queue. */
} stc_mcan_tx_msg_t;

/**
 * @brief MCAN Rx message structure definition
 */
typedef struct {
    uint32_t ID;                        /*!< Specifies the ID.
                                             This parameter must be a number between:
                                             - 0 and 0x7FF, if IDE is 0
                                             - 0 and 0x1FFFFFFF, if IDE is 1 */
    uint32_t IDE;                       /*!< IDentifier Extension bit. Specifies the ID type for the received message.
                                             This parameter can be a value of:
                                             - 0: 11-bit standard ID
                                             - 1: 29-bit extended ID */
    uint32_t RTR;                       /*!< Remote Transmission Request. Specifies the frame type of the received message.
                                             This parameter can be a value of:
                                             - 0: Data frame received
                                             - 1: Remote frame received */
    uint32_t DLC;                       /*!< Data Length Code. Specifies the length of data filed of the received frame.
                                             This parameter can be a value of @ref MCAN_Data_Length_Code */
    uint32_t ESI;                       /*!< Error State Indicator. Specifies the error state indicator.
                                             This parameter can be a value of:
                                             - 0: Transmitting node is error active
                                             - 1: Transmitting node is error passive */
    uint32_t BRS;                       /*!< Bit Rate Switch. Specifies whether the Tx frame is received with or without bit rate switching.
                                             This parameter can be a value of:
                                             - 0: Frame received without bit rate switching
                                             - 1: Frame received with bit rate switching */
    uint32_t FDF;                       /*!< FD Format indicator. Specifies whether the Tx frame is received in classic or FD format.
                                             This parameter can be a value of:
                                             - 0: Classical CAN frame format
                                             - 1: CAN FD frame format (new DLC-coding and CRC) */
    uint32_t u32RxTimestamp;            /*!< Specifies the timestamp counter value captured on start of frame reception.
                                             This parameter must be a number between 0 and 0xFFFF */
    uint32_t u32FilterIndex;            /*!< Specifies the index of matching Rx acceptance filter element.
                                             This parameter must be a number between:
                                             - 0 and 127, if IDE is 0
                                             - 0 and 63, if IDE is 1 */
    uint32_t u32NmfFlag;                /*!< Specifies whether the accepted frame did not match any Rx filter.
                                             Acceptance of non-matching frames may be configured via @ref MCAN_GlobalFilterConfig()
                                             This parameter can be:
                                             - 0: Received frame matching filter index u32FilterIndex
                                             - 1: Received frame did not match any Rx filter element */
    uint8_t au8Data[64U];               /*!< Data payload of the received message */
    uint32_t u32DataSize;               /*!< Size of Rx data payload */
} stc_mcan_rx_msg_t;

/**
 * @brief MCAN Tx event structure definition
 */
typedef struct {
    uint32_t ID;                        /*!< Specifies the ID.
                                             This parameter must be a number between:
                                             - 0 and 0x7FF, if IDE is 0
                                             - 0 and 0x1FFFFFFF, if IDE is 1 */
    uint32_t IDE;                       /*!< IDentifier Extension bit. Specifies the ID type for the transmitted message.
                                             This parameter can be a value of:
                                             - 0: 11-bit standard ID
                                             - 1: 29-bit extended ID */
    uint32_t RTR;                       /*!< Remote Transmission Request. Specifies the frame type of the transmitted message.
                                             This parameter can be a value of:
                                             - 0: Data frame transmitted
                                             - 1: Remote frame transmitted */
    uint32_t DLC;                       /*!< Data Length Code. Specifies the length of the transmitted frame.
                                             This parameter can be a value of @ref MCAN_Data_Length_Code */
    uint32_t ESI;                       /*!< Error State Indicator. Specifies the error state indicator.
                                             This parameter can be a value of:
                                             - 0: Transmitting node is error active
                                             - 1: Transmitting node is error passive */
    uint32_t BRS;                       /*!< Bit Rate Switch. Specifies whether the Tx frame is transmitted with or without bit rate switching.
                                             This parameter can be a value of:
                                             - 0: Frame transmitted without bit rate switching
                                             - 1: Frame transmitted with bit rate switching */
    uint32_t FDF;                       /*!< FD Format indicator. Specifies whether the Tx frame is transmitted in classic or FD format.
                                             This parameter can be a value of:
                                             - 0: Classical CAN frame format
                                             - 1: CAN FD frame format (new DLC-coding and CRC) */
    uint32_t u32TxTimestamp;            /*!< Specifies the timestamp counter value captured on start of frame transmission.
                                             This parameter is valid only when 8-bit message marker used.
                                             This parameter must be a number between 0 and 0xFFFF. */
    uint32_t u32MsgMarker;              /*!< Specifies the message marker copied into Tx Event FIFO element for identification of Tx message status.
                                             This parameter must be a number between:
                                             - 0 and 0xFF if 8-bit message marker used(CCCR.WMM == 0)
                                             - 0 and 0xFFFF if 16-bit-width message marker used(CCCR.WMM == 1) */
    uint32_t u32EventType;              /*!< Specifies the event type.
                                             This parameter can be a value of @ref MCAN_Evt_Type */
} stc_mcan_tx_event_t;

/**
 * @brief MCAN high priority message status structure definition
 */
typedef struct {
    uint8_t u8FilterListType;           /*!< Specifies the filter list of the matching filter element.
                                             This parameter can be:
                                             - 0: Standard filter list
                                             - 1: Extended filter list */
    uint8_t u8FilterIndex;              /*!< Specifies the index of matching filter element.
                                             This parameter can be a number between:
                                             - 0 and 127, if u8FilterListType is 0 (Standard)
                                             - 0 and 63, if u8FilterListType is 1 (Extended) */
    uint8_t u8MsgStorage;               /*!< Specifies the high priority message storage.
                                             This parameter can be a value of @ref MCAN_HPM_Storage */
    uint8_t u8MsgIndex;                 /*!< Specifies the index of Rx FIFO element to which the message was stored.
                                             This parameter is valid only when u8MsgStorage is:
                                             MCAN_HPM_STORED_IN_RX_FIFO0 or MCAN_HPM_STORED_IN_RX_FIFO1 */
} stc_mcan_hpm_status_t;

/**
 * @brief MCAN protocol status structure definition
 */
typedef struct {
    uint8_t u8LastErrorCode;            /*!< Specifies the type of the last error that occurred on the CAN bus.
                                             This parameter can be a value of @ref MCAN_Protocol_Error_Code */
    uint8_t u8DataLastErrorCode;        /*!< Specifies the type of the last error that occurred in the data phase of a CAN FD format
                                             frame with its BRS flag set.
                                             This parameter can be a value of @ref MCAN_Protocol_Error_Code */
    uint8_t u8ComState;                 /*!< Specifies the CAN module communication state.
                                             This parameter can be a value of @ref MCAN_Com_State */
    uint8_t u8ErrorPassiveFlag;         /*!< Specifies the CAN module error status.
                                             This parameter can be:
                                             - 0: The CAN is in the Error_Active state
                                             - 1: The CAN is in the Error_Passive state */
    uint8_t u8WarningFlag;              /*!< Specifies the CAN module warning status.
                                             This parameter can be:
                                             - 0: Both error counters are below the Error_Warning limit of 96
                                             - 1: At least one of error counter has reached the Error_Warning limit of 96 */
    uint8_t u8BusOffFlag;               /*!< Specifies the CAN module Bus_Off status.
                                             This parameter can be:
                                             - 0: The CAN is not in Bus_Off state
                                             - 1: The CAN is in Bus_Off state */
    uint8_t u8RxESIFlag;                /*!< Specifies ESI flag of last received CAN FD message.
                                             This parameter can be:
                                             - 0: Last received CAN FD message did not have its ESI flag set
                                             - 1: Last received CAN FD message had its ESI flag set */
    uint8_t u8RxBRSFlag;                /*!< Specifies BRS flag of last received CAN FD message.
                                             This parameter can be:
                                             - 0: Last received CAN FD message did not have its BRS flag set
                                             - 1: Last received CAN FD message had its BRS flag set */
    uint8_t u8RxFDFFlag;                /*!< Specifies if CAN FD message (FDF flag set) has been received since last protocol status.
                                             This parameter can be:
                                             - 0: Since this bit was reset by the CPU, no CAN FD message has been received
                                             - 1: Message in CAN FD format with FDF flag set has been received */
    uint8_t u8ProtocolExceptionFlag;    /*!< Specifies the CAN module protocol exception status.
                                             This parameter can be:
                                             - 0: No protocol exception event occurred since last read access
                                             - 1: Protocol exception event occurred */
    uint8_t u8TdcValue;                 /*!< Specifies the Transmitter Delay Compensation Value.
                                             This parameter can be a number between 0 and 127 */

} stc_mcan_protocol_status_t;

/**
 * @brief MCAN error counters structure definition
 */
typedef struct {
    uint8_t u8TxErrorCount;             /*!< Specifies the Transmit Error Counter Value.
                                             This parameter can be a number between 0 and 255 */
    uint8_t u8RxErrorCount;             /*!< Specifies the Receive Error Counter Value.
                                             This parameter can be a number between 0 and 127 */
    uint8_t u8RxErrorPassive;           /*!< Specifies the Receive Error Passive status.
                                             This parameter can be:
                                             - 0: The Receive Error Counter (u8RxErrorCount) is below the error passive level of 128
                                             - 1: The Receive Error Counter (u8RxErrorCount) has reached the error passive level of 128 */
    uint8_t u8ErrorLogging;             /*!< Specifies the Transmit/Receive error logging counter value.
                                             This parameter can be a number between 0 and 255.
                                             This counter is incremented each time when a CAN protocol error causes the u8TxErrorCount
                                             or the u8RxErrorCount to be incremented. The counter stops at 255; the next increment of
                                             u8TxErrorCount or u8RxErrorCount sets interrupt flag MCAN_FLAG_ERR_LOG_OVF */
} stc_mcan_error_counter_t;

/**
 * @}
 */

