RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/hc32_ll_driver/inc/hc32_ll_mcan.h
/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup MCAN_Global_Macros MCAN Global Macros
 * @{
 */
/**
 * @defgroup MCAN_Operating_Mode MCAN Operating Mode
 * @{
 */
#define MCAN_MD_NORMAL                  (0U)                /*!< Normal mode */
#define MCAN_MD_RESTRICTED_OP           (1U)                /*!< Restricted operation mode */
#define MCAN_MD_BUS_MON                 (2U)                /*!< Bus monitoring mode */
#define MCAN_MD_INTERN_LOOPBACK         (3U)                /*!< Internal loopBack mode */
#define MCAN_MD_EXTERN_LOOPBACK         (4U)                /*!< External loopBack mode */
/**
 * @}
 */

/**
 * @defgroup MCAN_Msg_RAM_Info MCAN Message RAM Information
 * @{
 */
#define MCAN_MSG_RAM_BASE               (0x4002B000UL)      /*!< MCAN message RAM start address */
#define MCAN_MSG_RAM_SIZE               (1024UL * 2UL)      /*!< MCAN message RAM size */
#define MCAN_MSG_RAM_END                (MCAN_MSG_RAM_BASE + \
                                         MCAN_MSG_RAM_SIZE) /*!< MCAN message RAM end address */
/**
 * @}
 */

/**
 * @defgroup MCAN_ID_Type MCAN ID Type
 * @{
 */
#define MCAN_STD_ID                     (0U)                /*!< Standard ID */
#define MCAN_EXT_ID                     (1U)                /*!< Extended ID */
/**
 * @}
 */

/**
 * @defgroup MCAN_ID_Mask MCAN ID Mask
 * @{
 */
#define MCAN_STD_ID_MASK                (0x7FFUL)           /*!< Standard ID mask */
#define MCAN_EXT_ID_MASK                (0x1FFFFFFFUL)      /*!< Extended ID mask */
/**
 * @}
 */

/**
 * @defgroup MCAN_Frame_Format MCAN Frame Format
 * @{
 */
#define MCAN_FRAME_CLASSIC              (0x0U)              /*!< Classic CAN mode */
#define MCAN_FRAME_ISO_FD_NO_BRS        (MCAN_CCCR_FDOE)    /*!< ISO CAN FD mode without bit rate switching */
#define MCAN_FRAME_ISO_FD_BRS           (MCAN_CCCR_FDOE | \
                                         MCAN_CCCR_BRSE)    /*!< ISO CAN FD mode with bit rate switching */
#define MCAN_FRAME_NON_ISO_FD_NO_BRS    (MCAN_CCCR_NISO | \
                                         MCAN_CCCR_FDOE)    /*!< Non-ISO CAN FD mode without bit rate switching */
#define MCAN_FRAME_NON_ISO_FD_BRS       (MCAN_CCCR_NISO | \
                                         MCAN_CCCR_FDOE | \
                                         MCAN_CCCR_BRSE)    /*!< Non-ISO CAN FD mode with bit rate switching */
/**
 * @}
 */

/**
 * @defgroup MCAN_Auto_Retx_Enable MCAN Automatic Retransmission Enable
 * @{
 */
#define MCAN_AUTO_RETX_DISABLE          (MCAN_CCCR_DAR)     /*!< Disable automatic retransmission */
#define MCAN_AUTO_RETX_ENABLE           (0x0U)              /*!< Automatic retransmission of messages not transmitted successfully */
/**
 * @}
 */

/**
 * @defgroup MCAN_Tx_Pause_Enable MCAN Tx Pause Enable
 * @{
 */
#define MCAN_TX_PAUSE_DISABLE           (0x0U)              /*!< Disable transmit pause */
#define MCAN_TX_PAUSE_ENABLE            (MCAN_CCCR_TXP)     /*!< Enable transmit pause */
/**
 * @}
 */

/**
 * @defgroup MCAN_Msg_Marker_Cfg MCAN Message Marker Configuration
 * @{
 */
#define MCAN_MSG_MARKER_8BIT            (0U)                /*!< 8-bit message marker used */
#define MCAN_MSG_MARKER_16BIT           (MCAN_CCCR_WMM)     /*!< 16-bit Message Marker used, replacing 16-bit timestamps in Tx Event FIFO */
/**
 * @}
 */

/**
 * @defgroup MCAN_Protocol_Exception_Enable MCAN Protocol Exception Enable
 * @{
 */
#define MCAN_PROTOCOL_EXP_DISABLE       (MCAN_CCCR_PXHD)    /*!< Disable protocol exception handling */
#define MCAN_PROTOCOL_EXP_ENABLE        (0x0U)              /*!< Enable protocol exception handling */
/**
 * @}
 */

/**
 * @defgroup MCAN_TDC_Enable MCAN Transmitter Delay Compensation Enable
 * @{
 */
#define MCAN_FD_TDC_DISABLE             (0x0U)              /*!< Disable transmitter delay compensation. */
#define MCAN_FD_TDC_ENABLE              (MCAN_DBTP_TDC)     /*!< Enable transmitter delay compensation.  */
/**
 * @}
 */

/**
 * @defgroup MCAN_Tx_Pin_Ctrl MCAN Tx Pin Control
 * @{
 */
#define MCAN_TX_PIN_NORMAL              (0U)                /*!< Tx pin controlled by the CAN Core, updated at the end of the CAN bit time */
#define MCAN_TX_PIN_MONITOR             (MCAN_TEST_TX_0)    /*!< Sample Point can be monitored at Tx pin */
#define MCAN_TX_PIN_DOMINANT            (MCAN_TEST_TX_1)    /*!< Dominant ('0') level at Tx pin */
#define MCAN_TX_PIN_RECESSIVE           (MCAN_TEST_TX)      /*!< Recessive ('1') level at Tx pin */
/**
 * @}
 */

/**
 * @defgroup MCAN_Data_Length_Code MCAN Data Length Code
 * @{
 */
#define MCAN_DLC0                       (0x0U)              /*!< Classic-CAN and FD-CAN: data field size is 0 bytes. */
#define MCAN_DLC1                       (0x1U)              /*!< Classic-CAN and FD-CAN: data field size is 1 bytes. */
#define MCAN_DLC2                       (0x2U)              /*!< Classic-CAN and FD-CAN: data field size is 2 bytes. */
#define MCAN_DLC3                       (0x3U)              /*!< Classic-CAN and FD-CAN: data field size is 3 bytes. */
#define MCAN_DLC4                       (0x4U)              /*!< Classic-CAN and FD-CAN: data field size is 4 bytes. */
#define MCAN_DLC5                       (0x5U)              /*!< Classic-CAN and FD-CAN: data field size is 5 bytes. */
#define MCAN_DLC6                       (0x6U)              /*!< Classic-CAN and FD-CAN: data field size is 6 bytes. */
#define MCAN_DLC7                       (0x7U)              /*!< Classic-CAN and FD-CAN: data field size is 7 bytes. */
#define MCAN_DLC8                       (0x8U)              /*!< Classic-CAN and FD-CAN: data field size is 8 bytes. */
#define MCAN_DLC12                      (0x9U)              /*!< Classic-CAN: data field size is 8 bytes; FD-CAN: data field size is 12 bytes. */
#define MCAN_DLC16                      (0xAU)              /*!< Classic-CAN: data field size is 8 bytes; FD-CAN: data field size is 16 bytes. */
#define MCAN_DLC20                      (0xBU)              /*!< Classic-CAN: data field size is 8 bytes; FD-CAN: data field size is 20 bytes. */
#define MCAN_DLC24                      (0xCU)              /*!< Classic-CAN: data field size is 8 bytes; FD-CAN: data field size is 24 bytes. */
#define MCAN_DLC32                      (0xDU)              /*!< Classic-CAN: data field size is 8 bytes; FD-CAN: data field size is 32 bytes. */
#define MCAN_DLC48                      (0xEU)              /*!< Classic-CAN: data field size is 8 bytes; FD-CAN: data field size is 48 bytes. */
#define MCAN_DLC64                      (0xFU)              /*!< Classic-CAN: data field size is 8 bytes; FD-CAN: data field size is 64 bytes. */
/**
 * @}
 */

/**
 * @defgroup MCAN_Data_Field_Size  MCAN Data Field Size
 * @{
 */
#define MCAN_DATA_SIZE_8BYTE            (0x0U)              /*!< 8 bytes data field */
#define MCAN_DATA_SIZE_12BYTE           (0x1U)              /*!< 12 bytes data field */
#define MCAN_DATA_SIZE_16BYTE           (0x2U)              /*!< 16 bytes data field */
#define MCAN_DATA_SIZE_20BYTE           (0x3U)              /*!< 20 bytes data field */
#define MCAN_DATA_SIZE_24BYTE           (0x4U)              /*!< 24 bytes data field */
#define MCAN_DATA_SIZE_32BYTE           (0x5U)              /*!< 32 bytes data field */
#define MCAN_DATA_SIZE_48BYTE           (0x6U)              /*!< 48 bytes data field */
#define MCAN_DATA_SIZE_64BYTE           (0x7U)              /*!< 64 bytes data field */
/**
 * @}
 */

/**
 * @defgroup MCAN_Tx_FIFO_Queue_Mode MCAN Tx FIFO/Queue Mode
 * @{
 */
#define MCAN_TX_FIFO_MD                 (0x0U)              /*!< Tx FIFO operation mode */
#define MCAN_TX_QUEUE_MD                (MCAN_TXBC_TFQM)    /*!< Tx Queue operation mode */
/**
 * @}
 */

/**
 * @defgroup MCAN_Filter_Type MCAN Filter Type
 * @{
 */
#define MCAN_FILTER_RANGE               (0x0U)              /*!< Range filter from filter ID1 to filter ID2 */
#define MCAN_FILTER_DUAL                (0x1U)              /*!< Dual ID filter for filter ID1 or filter ID2 */
#define MCAN_FILTER_MASK                (0x2U)              /*!< Classic filter: filter ID1 = filter, filter ID2 = mask */
#define MCAN_FILTER_RANGE_NO_EIDM       (0x3U)              /*!< Range filter from filter ID1 to filter ID2, EIDM mask not applied */
/**
 * @}
 */

/**
 * @defgroup MCAN_Filter_Config MCAN Filter Configuration
 * @{
 */
#define MCAN_FILTER_DISABLE             (0x0U)              /*!< Disable filter element */
#define MCAN_FILTER_TO_RX_FIFO0         (0x1U)              /*!< Store in Rx FIFO 0 if filter matches */
#define MCAN_FILTER_TO_RX_FIFO1         (0x2U)              /*!< Store in Rx FIFO 1 if filter matches */
#define MCAN_FILTER_REJECT              (0x3U)              /*!< Reject ID if filter matches */
#define MCAN_FILTER_HP_NO_STORAGE       (0x4U)              /*!< Set high priority if filter matches, no storage */
#define MCAN_FILTER_HP_TO_RX_FIFO0      (0x5U)              /*!< Set high priority and store in FIFO 0 if filter matches */
#define MCAN_FILTER_HP_TO_RX_FIFO1      (0x6U)              /*!< Set high priority and store in FIFO 1 if filter matches */
#define MCAN_FILTER_TO_RX_BUF           (0x7U)              /*!< Store into Rx buffer, configuration of @ref MCAN_Filter_Type ignored */
/**
 * @}
 */

/**
 * @defgroup MCAN_Tx_Location MCAN Tx Location
 * @{
 */
#define MCAN_TX_BUF0                    (0x1UL << 0U)       /*!< Add message to Tx buffer 0  */
#define MCAN_TX_BUF1                    (0x1UL << 1U)       /*!< Add message to Tx buffer 1  */
#define MCAN_TX_BUF2                    (0x1UL << 2U)       /*!< Add message to Tx buffer 2  */
#define MCAN_TX_BUF3                    (0x1UL << 3U)       /*!< Add message to Tx buffer 3  */
#define MCAN_TX_BUF4                    (0x1UL << 4U)       /*!< Add message to Tx buffer 4  */
#define MCAN_TX_BUF5                    (0x1UL << 5U)       /*!< Add message to Tx buffer 5  */
#define MCAN_TX_BUF6                    (0x1UL << 6U)       /*!< Add message to Tx buffer 6  */
#define MCAN_TX_BUF7                    (0x1UL << 7U)       /*!< Add message to Tx buffer 7  */
#define MCAN_TX_BUF8                    (0x1UL << 8U)       /*!< Add message to Tx buffer 8  */
#define MCAN_TX_BUF9                    (0x1UL << 9U)       /*!< Add message to Tx buffer 9  */
#define MCAN_TX_BUF10                   (0x1UL << 10U)      /*!< Add message to Tx buffer 10 */
#define MCAN_TX_BUF11                   (0x1UL << 11U)      /*!< Add message to Tx buffer 11 */
#define MCAN_TX_BUF12                   (0x1UL << 12U)      /*!< Add message to Tx buffer 12 */
#define MCAN_TX_BUF13                   (0x1UL << 13U)      /*!< Add message to Tx buffer 13 */
#define MCAN_TX_BUF14                   (0x1UL << 14U)      /*!< Add message to Tx buffer 14 */
#define MCAN_TX_BUF15                   (0x1UL << 15U)      /*!< Add message to Tx buffer 15 */
#define MCAN_TX_BUF16                   (0x1UL << 16U)      /*!< Add message to Tx buffer 16 */
#define MCAN_TX_BUF17                   (0x1UL << 17U)      /*!< Add message to Tx buffer 17 */
#define MCAN_TX_BUF18                   (0x1UL << 18U)      /*!< Add message to Tx buffer 18 */
#define MCAN_TX_BUF19                   (0x1UL << 19U)      /*!< Add message to Tx buffer 19 */
#define MCAN_TX_BUF20                   (0x1UL << 20U)      /*!< Add message to Tx buffer 20 */
#define MCAN_TX_BUF21                   (0x1UL << 21U)      /*!< Add message to Tx buffer 21 */
#define MCAN_TX_BUF22                   (0x1UL << 22U)      /*!< Add message to Tx buffer 22 */
#define MCAN_TX_BUF23                   (0x1UL << 23U)      /*!< Add message to Tx buffer 23 */
#define MCAN_TX_BUF24                   (0x1UL << 24U)      /*!< Add message to Tx buffer 24 */
#define MCAN_TX_BUF25                   (0x1UL << 25U)      /*!< Add message to Tx buffer 25 */
#define MCAN_TX_BUF26                   (0x1UL << 26U)      /*!< Add message to Tx buffer 26 */
#define MCAN_TX_BUF27                   (0x1UL << 27U)      /*!< Add message to Tx buffer 27 */
#define MCAN_TX_BUF28                   (0x1UL << 28U)      /*!< Add message to Tx buffer 28 */
#define MCAN_TX_BUF29                   (0x1UL << 29U)      /*!< Add message to Tx buffer 29 */
#define MCAN_TX_BUF30                   (0x1UL << 30U)      /*!< Add message to Tx buffer 30 */
#define MCAN_TX_BUF31                   (0x1UL << 31U)      /*!< Add message to Tx buffer 31 */
#define MCAN_TX_BUF_ALL                 (0xFFFFFFFFUL)
/**
 * @}
 */

/**
 * @defgroup MCAN_Rx_Location MCAN Rx Location
 * @{
 */
#define MCAN_RX_FIFO0                   (0x40U)             /*!< Get received message from Rx FIFO 0 */
#define MCAN_RX_FIFO1                   (0x41U)             /*!< Get received message from Rx FIFO 1 */
#define MCAN_RX_BUF0                    (0x00U)             /*!< Get received message from Rx buffer 0 */
#define MCAN_RX_BUF1                    (0x01U)             /*!< Get received message from Rx buffer 1 */
#define MCAN_RX_BUF2                    (0x02U)             /*!< Get received message from Rx buffer 2 */
#define MCAN_RX_BUF3                    (0x03U)             /*!< Get received message from Rx buffer 3 */
#define MCAN_RX_BUF4                    (0x04U)             /*!< Get received message from Rx buffer 4 */
#define MCAN_RX_BUF5                    (0x05U)             /*!< Get received message from Rx buffer 5 */
#define MCAN_RX_BUF6                    (0x06U)             /*!< Get received message from Rx buffer 6 */
#define MCAN_RX_BUF7                    (0x07U)             /*!< Get received message from Rx buffer 7 */
#define MCAN_RX_BUF8                    (0x08U)             /*!< Get received message from Rx buffer 8 */
#define MCAN_RX_BUF9                    (0x09U)             /*!< Get received message from Rx buffer 9 */
#define MCAN_RX_BUF10                   (0x0AU)             /*!< Get received message from Rx buffer 10 */
#define MCAN_RX_BUF11                   (0x0BU)             /*!< Get received message from Rx buffer 11 */
#define MCAN_RX_BUF12                   (0x0CU)             /*!< Get received message from Rx buffer 12 */
#define MCAN_RX_BUF13                   (0x0DU)             /*!< Get received message from Rx buffer 13 */
#define MCAN_RX_BUF14                   (0x0EU)             /*!< Get received message from Rx buffer 14 */
#define MCAN_RX_BUF15                   (0x0FU)             /*!< Get received message from Rx buffer 15 */
#define MCAN_RX_BUF16                   (0x10U)             /*!< Get received message from Rx buffer 16 */
#define MCAN_RX_BUF17                   (0x11U)             /*!< Get received message from Rx buffer 17 */
#define MCAN_RX_BUF18                   (0x12U)             /*!< Get received message from Rx buffer 18 */
#define MCAN_RX_BUF19                   (0x13U)             /*!< Get received message from Rx buffer 19 */
#define MCAN_RX_BUF20                   (0x14U)             /*!< Get received message from Rx buffer 20 */
#define MCAN_RX_BUF21                   (0x15U)             /*!< Get received message from Rx buffer 21 */
#define MCAN_RX_BUF22                   (0x16U)             /*!< Get received message from Rx buffer 22 */
#define MCAN_RX_BUF23                   (0x17U)             /*!< Get received message from Rx buffer 23 */
#define MCAN_RX_BUF24                   (0x18U)             /*!< Get received message from Rx buffer 24 */
#define MCAN_RX_BUF25                   (0x19U)             /*!< Get received message from Rx buffer 25 */
#define MCAN_RX_BUF26                   (0x1AU)             /*!< Get received message from Rx buffer 26 */
#define MCAN_RX_BUF27                   (0x1BU)             /*!< Get received message from Rx buffer 27 */
#define MCAN_RX_BUF28                   (0x1CU)             /*!< Get received message from Rx buffer 28 */
#define MCAN_RX_BUF29                   (0x1DU)             /*!< Get received message from Rx buffer 29 */
#define MCAN_RX_BUF30                   (0x1EU)             /*!< Get received message from Rx buffer 30 */
#define MCAN_RX_BUF31                   (0x1FU)             /*!< Get received message from Rx buffer 31 */
#define MCAN_RX_BUF32                   (0x20U)             /*!< Get received message from Rx buffer 32 */
#define MCAN_RX_BUF33                   (0x21U)             /*!< Get received message from Rx buffer 33 */
#define MCAN_RX_BUF34                   (0x22U)             /*!< Get received message from Rx buffer 34 */
#define MCAN_RX_BUF35                   (0x23U)             /*!< Get received message from Rx buffer 35 */
#define MCAN_RX_BUF36                   (0x24U)             /*!< Get received message from Rx buffer 36 */
#define MCAN_RX_BUF37                   (0x25U)             /*!< Get received message from Rx buffer 37 */
#define MCAN_RX_BUF38                   (0x26U)             /*!< Get received message from Rx buffer 38 */
#define MCAN_RX_BUF39                   (0x27U)             /*!< Get received message from Rx buffer 39 */
#define MCAN_RX_BUF40                   (0x28U)             /*!< Get received message from Rx buffer 40 */
#define MCAN_RX_BUF41                   (0x29U)             /*!< Get received message from Rx buffer 41 */
#define MCAN_RX_BUF42                   (0x2AU)             /*!< Get received message from Rx buffer 42 */
#define MCAN_RX_BUF43                   (0x2BU)             /*!< Get received message from Rx buffer 43 */
#define MCAN_RX_BUF44                   (0x2CU)             /*!< Get received message from Rx buffer 44 */
#define MCAN_RX_BUF45                   (0x2DU)             /*!< Get received message from Rx buffer 45 */
#define MCAN_RX_BUF46                   (0x2EU)             /*!< Get received message from Rx buffer 46 */
#define MCAN_RX_BUF47                   (0x2FU)             /*!< Get received message from Rx buffer 47 */
#define MCAN_RX_BUF48                   (0x30U)             /*!< Get received message from Rx buffer 48 */
#define MCAN_RX_BUF49                   (0x31U)             /*!< Get received message from Rx buffer 49 */
#define MCAN_RX_BUF50                   (0x32U)             /*!< Get received message from Rx buffer 50 */
#define MCAN_RX_BUF51                   (0x33U)             /*!< Get received message from Rx buffer 51 */
#define MCAN_RX_BUF52                   (0x34U)             /*!< Get received message from Rx buffer 52 */
#define MCAN_RX_BUF53                   (0x35U)             /*!< Get received message from Rx buffer 53 */
#define MCAN_RX_BUF54                   (0x36U)             /*!< Get received message from Rx buffer 54 */
#define MCAN_RX_BUF55                   (0x37U)             /*!< Get received message from Rx buffer 55 */
#define MCAN_RX_BUF56                   (0x38U)             /*!< Get received message from Rx buffer 56 */
#define MCAN_RX_BUF57                   (0x39U)             /*!< Get received message from Rx buffer 57 */
#define MCAN_RX_BUF58                   (0x3AU)             /*!< Get received message from Rx buffer 58 */
#define MCAN_RX_BUF59                   (0x3BU)             /*!< Get received message from Rx buffer 59 */
#define MCAN_RX_BUF60                   (0x3CU)             /*!< Get received message from Rx buffer 60 */
#define MCAN_RX_BUF61                   (0x3DU)             /*!< Get received message from Rx buffer 61 */
#define MCAN_RX_BUF62                   (0x3EU)             /*!< Get received message from Rx buffer 62 */
#define MCAN_RX_BUF63                   (0x3FU)             /*!< Get received message from Rx buffer 63 */
#define MCAN_RX_BUF_MAX                 MCAN_RX_BUF63
/**
 * @}
 */

/**
 * @defgroup MCAN_HPM_Storage MCAN High Priority Message Storage
 * @{
 */
#define MCAN_HPM_NO_STORAGE             (0x0U)              /*!< No FIFO selected */
#define MCAN_HPM_LOST                   (0x1U)              /*!< FIFO message lost */
#define MCAN_HPM_STORED_IN_RX_FIFO0     (0x2U)              /*!< Message stored in FIFO 0 */
#define MCAN_HPM_STORED_IN_RX_FIFO1     (0x3U)              /*!< Message stored in FIFO 1 */
/**
 * @}
 */

/**
 * @defgroup MCAN_Protocol_Error_Code MCAN Protocol Error Code
 * @{
 */
#define MCAN_PROTOCOL_NONE_ERR          (0x0U)              /*!< No error occurred */
#define MCAN_PROTOCOL_STUFF_ERR         (0x1U)              /*!< Stuff error */
#define MCAN_PROTOCOL_FORM_ERR          (0x2U)              /*!< Form error */
#define MCAN_PROTOCOL_ACK_ERR           (0x3U)              /*!< Acknowledge error */
#define MCAN_PROTOCOL_BIT1_ERR          (0x4U)              /*!< Bit 1 (recessive) error */
#define MCAN_PROTOCOL_BIT0_ERR          (0x5U)              /*!< Bit 0 (dominant) error */
#define MCAN_PROTOCOL_CRC_ERR           (0x6U)              /*!< CRC check sum error */
#define MCAN_PROTOCOL_ERR_NO_CHANGE     (0x7U)              /*!< No change since last read */
/**
 * @}
 */

/**
 * @defgroup MCAN_Com_State MCAN Communication State
 * @{
 */
#define MCAN_COM_STATE_SYNC             (0x0U)              /*!< Node is synchronizing on CAN communication */
#define MCAN_COM_STATE_IDLE             (0x1U)              /*!< Node is neither receiver nor transmitter */
#define MCAN_COM_STATE_RX               (0x2U)              /*!< Node is operating as receiver */
#define MCAN_COM_STATE_TX               (0x3U)              /*!< Node is operating as transmitter */
/**
 * @}
 */

/**
 * @defgroup MCAN_Protocol_Flag MCAN Protocol Status Flag
 * @{
 */
#define MCAN_PROTOCOL_FLAG_PROTOCOL_EXCEPTION   (MCAN_PSR_PXE)      /*!< Protocol exception event occurred */
#define MCAN_PROTOCOL_FLAG_RX_FDF               (MCAN_PSR_RFDF)     /*!< Message in CAN FD format with FDF flag set has been received */
#define MCAN_PROTOCOL_FLAG_RX_BRS               (MCAN_PSR_RBRS)     /*!< Last received CAN FD message had its BRS flag set */
#define MCAN_PROTOCOL_FLAG_RX_ESI               (MCAN_PSR_RESI)     /*!< Last received CAN FD message had its ESI flag set */
#define MCAN_PROTOCOL_FLAG_BUS_OFF              (MCAN_PSR_BO)       /*!< The MCAN is in Bus_Off state */
#define MCAN_PROTOCOL_FLAG_ERR_WARNING          (MCAN_PSR_EW)       /*!< At least one of error counter has reached the Error_Warning limit of 96 */
#define MCAN_PROTOCOL_FLAG_ERR_PASSIVE          (MCAN_PSR_EP)       /*!< The MCAN is in the Error_Passive state */
#define MCAN_PROTOCOL_FLAG_ALL                  (MCAN_PROTOCOL_FLAG_PROTOCOL_EXCEPTION | MCAN_PROTOCOL_FLAG_RX_FDF | \
                                                 MCAN_PROTOCOL_FLAG_RX_BRS | MCAN_PROTOCOL_FLAG_RX_ESI | \
                                                 MCAN_PROTOCOL_FLAG_BUS_OFF | MCAN_PROTOCOL_FLAG_ERR_WARNING | \
                                                 MCAN_PROTOCOL_FLAG_ERR_PASSIVE)
/**
 * @}
 */

/**
 * @defgroup MCAN_Watermark_Fifo MCAN Watermark FIFO
 * @{
 */
#define MCAN_WATERMARK_RX_FIFO0         (0x0U)              /*!< Rx FIFO0 */
#define MCAN_WATERMARK_RX_FIFO1         (0x1U)              /*!< Rx FIFO1 */
#define MCAN_WATERMARK_TX_EVT_FIFO      (0x2U)              /*!< Tx event FIFO */
/**
 * @}
 */

/**
 * @defgroup MCAN_Rx_Fifo_Operation_Mode MCAN FIFO Operation Mode
 * @{
 */
#define MCAN_RX_FIFO_BLOCKING           (0x0U)              /*!< Rx FIFO blocking mode.
                                                                 New received message will be discarded. */
#define MCAN_RX_FIFO_OVERWRITE          (MCAN_RXF0C_F0OM)   /*!< Rx FIFO overwrite mode.
                                                                 New received message will overwrite the oldest received message. */
/**
 * @}
 */

