RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/hc32_ll_driver/inc/hc32_ll_mcan.h
/**
 * @defgroup MCAN_NMF_Operation MCAN Non-matching Frame Operation
 * @{
 */
#define MCAN_NMF_ACCEPT_IN_RX_FIFO0     (0x0U)              /*!< Accept in Rx FIFO 0 */
#define MCAN_NMF_ACCEPT_IN_RX_FIFO1     (0x1U)              /*!< Accept in Rx FIFO 1 */
#define MCAN_NMF_REJECT                 (0x2U)              /*!< Reject all non-matching frames */
/**
 * @}
 */

/**
 * @defgroup MCAN_Remote_Frame_Operation MCAN Remote Frame Operation
 * @{
 */
#define MCAN_REMOTE_FRAME_FILTER        (0x0U)              /*!< Filter remote frames with ID */
#define MCAN_REMOTE_FRAME_REJECT        (0x1U)              /*!< Reject all remote frames */
/**
 * @}
 */

/**
 * @defgroup MCAN_Interrupt_Line MCAN Interrupt Line
 * @{
 */
#define MCAN_INT_LINE0                  (0x1U)              /*!< Interrupt line 0 */
#define MCAN_INT_LINE1                  (0x2U)              /*!< Interrupt line 1 */
/**
 * @}
 */

/**
 * @defgroup MCAN_Timeout_Select MCAN Timeout Select
 * @{
 */
#define MCAN_TIMEOUT_CONT               (0x0U)              /*!< Timeout continuous operation */
#define MCAN_TIMEOUT_TX_EVT_FIFO        (MCAN_TOCC_TOS_0)   /*!< Timeout controlled by Tx event FIFO */
#define MCAN_TIMEOUT_RX_FIFO0           (MCAN_TOCC_TOS_1)   /*!< Timeout controlled by Rx FIFO0 */
#define MCAN_TIMEOUT_RX_FIFO1           (MCAN_TOCC_TOS)     /*!< Timeout controlled by Rx FIFO1 */
/**
 * @}
 */

/**
 * @defgroup MCAN_Interrupt MCAN Interrupt
 * @{
 */
#define MCAN_INT_RX_FIFO0_NEW_MSG       (MCAN_IE_RF0NE)     /*!< New message written to Rx FIFO 0 */
#define MCAN_INT_RX_FIFO0_WATERMARK     (MCAN_IE_RF0WE)     /*!< Rx FIFO 0 fill level reached watermark */
#define MCAN_INT_RX_FIFO0_FULL          (MCAN_IE_RF0FE)     /*!< Rx FIFO 0 full */
#define MCAN_INT_RX_FIFO0_MSG_LOST      (MCAN_IE_RF0LE)     /*!< Rx FIFO 0 message lost */
#define MCAN_INT_RX_FIFO1_NEW_MSG       (MCAN_IE_RF1NE)     /*!< New message written to Rx FIFO 1 */
#define MCAN_INT_RX_FIFO1_WATERMARK     (MCAN_IE_RF1WE)     /*!< Rx FIFO 1 fill level reached watermark */
#define MCAN_INT_RX_FIFO1_FULL          (MCAN_IE_RF1FE)     /*!< Rx FIFO 1 full */
#define MCAN_INT_RX_FIFO1_MSG_LOST      (MCAN_IE_RF1LE)     /*!< Rx FIFO 1 message lost */
#define MCAN_INT_RX_HPM                 (MCAN_IE_HPME)      /*!< High priority message received */
#define MCAN_INT_TX_CPLT                (MCAN_IE_TCE)       /*!< Transmission completed */
#define MCAN_INT_TX_ABORT_CPLT          (MCAN_IE_TCFE)      /*!< Transmission cancellation finished */
#define MCAN_INT_TX_FIFO_EMPTY          (MCAN_IE_TFEE)      /*!< Tx FIFO empty */
#define MCAN_INT_TX_EVT_FIFO_NEW_DATA   (MCAN_IE_TEFNE)     /*!< Tx handler wrote Tx event FIFO element */
#define MCAN_INT_TX_EVT_FIFO_WATERMARK  (MCAN_IE_TEFWE)     /*!< Tx event FIFO fill level reached watermark */
#define MCAN_INT_TX_EVT_FIFO_FULL       (MCAN_IE_TEFFE)     /*!< Tx event FIFO full */
#define MCAN_INT_TX_EVT_FIFO_LOST       (MCAN_IE_TEFLE)     /*!< Tx event FIFO element lost */
#define MCAN_INT_TIMESTAMP_WRAPAROUND   (MCAN_IE_TSWE)      /*!< Timestamp counter wrapped around */
#define MCAN_INT_RAM_ACCESS_FAILURE     (MCAN_IE_MRAFE)     /*!< Message RAM access failure occurred */
#define MCAN_INT_TIMEOUT                (MCAN_IE_TOOE)      /*!< Timeout reached */
#define MCAN_INT_RX_BUF_NEW_MSG         (MCAN_IE_DRXE)      /*!< At least one received message stored into a Rx buffer */
#define MCAN_INT_ERR_LOG_OVF            (MCAN_IE_ELOE)      /*!< Overflow of CAN error logging counter occurred */
#define MCAN_INT_ERR_PASSIVE            (MCAN_IE_EPE)       /*!< Error_Passive status changed */
#define MCAN_INT_ERR_WARNING            (MCAN_IE_EWE)       /*!< Error_Warning status changed */
#define MCAN_INT_BUS_OFF                (MCAN_IE_BOE)       /*!< Bus_Off status changed */
#define MCAN_INT_RAM_WDT                (MCAN_IE_WDIE)      /*!< Message RAM Watchdog event due to missing READY */
#define MCAN_INT_ARB_PHASE_ERROR        (MCAN_IE_PEAE)      /*!< Protocol error in arbitration phase detected */
#define MCAN_INT_DATA_PHASE_ERROR       (MCAN_IE_PEDE)      /*!< Protocol error in data phase detected */
#define MCAN_INT_RSVD_ADDR_ACCESS       (MCAN_IE_ARAE)      /*!< Access to reserved address occurred */
#define MCAN_INT_ALL                    (0x3FCFFFFFUL)
/**
 * @}
 */

/**
 * @defgroup MCAN_Interrupt_Flag MCAN Interrupt Flag
 * @{
 */
#define MCAN_FLAG_RX_FIFO0_NEW_MSG      (MCAN_IR_RF0N)      /*!< New message written to Rx FIFO 0 */
#define MCAN_FLAG_RX_FIFO0_WATERMARK    (MCAN_IR_RF0W)      /*!< Rx FIFO 0 fill level reached watermark */
#define MCAN_FLAG_RX_FIFO0_FULL         (MCAN_IR_RF0F)      /*!< Rx FIFO 0 full */
#define MCAN_FLAG_RX_FIFO0_MSG_LOST     (MCAN_IR_RF0L)      /*!< Rx FIFO 0 message lost */
#define MCAN_FLAG_RX_FIFO1_NEW_MSG      (MCAN_IR_RF1N)      /*!< New message written to Rx FIFO 1 */
#define MCAN_FLAG_RX_FIFO1_WATERMARK    (MCAN_IR_RF1W)      /*!< Rx FIFO 1 fill level reached watermark */
#define MCAN_FLAG_RX_FIFO1_FULL         (MCAN_IR_RF1F)      /*!< Rx FIFO 1 full */
#define MCAN_FLAG_RX_FIFO1_MSG_LOST     (MCAN_IR_RF1L)      /*!< Rx FIFO 1 message lost */
#define MCAN_FLAG_RX_HPM                (MCAN_IR_HPM)       /*!< High priority message received */
#define MCAN_FLAG_TX_CPLT               (MCAN_IR_TC)        /*!< Transmission completed */
#define MCAN_FLAG_TX_ABORT_CPLT         (MCAN_IR_TCF)       /*!< Transmission cancellation finished */
#define MCAN_FLAG_TX_FIFO_EMPTY         (MCAN_IR_TFE)       /*!< Tx FIFO empty */
#define MCAN_FLAG_TX_EVT_FIFO_NEW_DATA  (MCAN_IR_TEFN)      /*!< Tx handler wrote Tx event FIFO element */
#define MCAN_FLAG_TX_EVT_FIFO_WATERMARK (MCAN_IR_TEFW)      /*!< Tx event FIFO fill level reached watermark */
#define MCAN_FLAG_TX_EVT_FIFO_FULL      (MCAN_IR_TEFF)      /*!< Tx event FIFO full */
#define MCAN_FLAG_TX_EVT_FIFO_LOST      (MCAN_IR_TEFL)      /*!< Tx event FIFO element lost */
#define MCAN_FLAG_TIMESTAMP_WRAPAROUND  (MCAN_IR_TSW)       /*!< Timestamp counter wrapped around */
#define MCAN_FLAG_RAM_ACCESS_FAILURE    (MCAN_IR_MRAF)      /*!< Message RAM access failure occurred */
#define MCAN_FLAG_TIMEOUT               (MCAN_IR_TOO)       /*!< Timeout reached */
#define MCAN_FLAG_RX_BUF_NEW_MSG        (MCAN_IR_DRX)       /*!< At least one received message stored into a Rx buffer */
#define MCAN_FLAG_ERR_LOG_OVF           (MCAN_IR_ELO)       /*!< Overflow of CAN error logging counter occurred */
#define MCAN_FLAG_ERR_PASSIVE           (MCAN_IR_EP)        /*!< Error_Passive status changed */
#define MCAN_FLAG_ERR_WARNING           (MCAN_IR_EW)        /*!< Error_Warning status changed */
#define MCAN_FLAG_BUS_OFF               (MCAN_IR_BO)        /*!< Bus_Off status changed */
#define MCAN_FLAG_RAM_WDT               (MCAN_IR_WDI)       /*!< Message RAM Watchdog event due to missing READY */
#define MCAN_FLAG_ARB_PHASE_ERROR       (MCAN_IR_PEA)       /*!< Protocol error in arbitration phase detected */
#define MCAN_FLAG_DATA_PHASE_ERROR      (MCAN_IR_PED)       /*!< Protocol error in data phase detected */
#define MCAN_FLAG_RSVD_ADDR_ACCESS      (MCAN_IR_ARA)       /*!< Access to reserved address occurred */
#define MCAN_FLAG_ALL                   (0x3FCFFFFFUL)
/**
 * @}
 */

/**
 * @defgroup MCAN_Evt_Type MCAN Event Type
 * @{
 */
#define MCAN_EVT_TX_EVT                 (0x01U)             /*!< Tx event */
#define MCAN_EVT_TX_WHEN_ABORTED        (0x02U)             /*!< Transmission in spite of cancellation (always set for transmissions in DAR mode) */
/**
 * @}
 */

/**
 * @}
 */

